frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/adcife.h
/* -------- ADCIFE_CALIB : (ADCIFE Offset: 0x3C) (R/W 32) Calibration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t CALIB:8;          /*!< bit:  0.. 7  Calibration Value                  */
    uint32_t BIASSEL:1;        /*!< bit:      8  Select bias mode                   */
    uint32_t :3;               /*!< bit:  9..11  Reserved                           */
    uint32_t BIASCAL:4;        /*!< bit: 12..15  Bias Calibration                   */
    uint32_t FCD:1;            /*!< bit:     16  Flash Calibration Done             */
    uint32_t :15;              /*!< bit: 17..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ADCIFE_CALIB_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADCIFE_CALIB_OFFSET         0x3C         /**< \brief (ADCIFE_CALIB offset) Calibration Register */
#define ADCIFE_CALIB_RESETVALUE     _U(0x00000000); /**< \brief (ADCIFE_CALIB reset_value) Calibration Register */

#define ADCIFE_CALIB_CALIB_Pos      0            /**< \brief (ADCIFE_CALIB) Calibration Value */
#define ADCIFE_CALIB_CALIB_Msk      (_U(0xFF) << ADCIFE_CALIB_CALIB_Pos)
#define ADCIFE_CALIB_CALIB(value)   (ADCIFE_CALIB_CALIB_Msk & ((value) << ADCIFE_CALIB_CALIB_Pos))
#define ADCIFE_CALIB_BIASSEL_Pos    8            /**< \brief (ADCIFE_CALIB) Select bias mode */
#define ADCIFE_CALIB_BIASSEL        (_U(0x1) << ADCIFE_CALIB_BIASSEL_Pos)
#define ADCIFE_CALIB_BIASCAL_Pos    12           /**< \brief (ADCIFE_CALIB) Bias Calibration */
#define ADCIFE_CALIB_BIASCAL_Msk    (_U(0xF) << ADCIFE_CALIB_BIASCAL_Pos)
#define ADCIFE_CALIB_BIASCAL(value) (ADCIFE_CALIB_BIASCAL_Msk & ((value) << ADCIFE_CALIB_BIASCAL_Pos))
#define ADCIFE_CALIB_FCD_Pos        16           /**< \brief (ADCIFE_CALIB) Flash Calibration Done */
#define ADCIFE_CALIB_FCD            (_U(0x1) << ADCIFE_CALIB_FCD_Pos)
#define ADCIFE_CALIB_MASK           _U(0x0001F1FF) /**< \brief (ADCIFE_CALIB) MASK Register */

/* -------- ADCIFE_VERSION : (ADCIFE Offset: 0x40) (R/  32) Version Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t VERSION:12;       /*!< bit:  0..11  Version number                     */
    uint32_t :4;               /*!< bit: 12..15  Reserved                           */
    uint32_t VARIANT:4;        /*!< bit: 16..19  Variant number                     */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ADCIFE_VERSION_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADCIFE_VERSION_OFFSET       0x40         /**< \brief (ADCIFE_VERSION offset) Version Register */
#define ADCIFE_VERSION_RESETVALUE   _U(0x00000100); /**< \brief (ADCIFE_VERSION reset_value) Version Register */

#define ADCIFE_VERSION_VERSION_Pos  0            /**< \brief (ADCIFE_VERSION) Version number */
#define ADCIFE_VERSION_VERSION_Msk  (_U(0xFFF) << ADCIFE_VERSION_VERSION_Pos)
#define ADCIFE_VERSION_VERSION(value) (ADCIFE_VERSION_VERSION_Msk & ((value) << ADCIFE_VERSION_VERSION_Pos))
#define ADCIFE_VERSION_VARIANT_Pos  16           /**< \brief (ADCIFE_VERSION) Variant number */
#define ADCIFE_VERSION_VARIANT_Msk  (_U(0xF) << ADCIFE_VERSION_VARIANT_Pos)
#define ADCIFE_VERSION_VARIANT(value) (ADCIFE_VERSION_VARIANT_Msk & ((value) << ADCIFE_VERSION_VARIANT_Pos))
#define ADCIFE_VERSION_MASK         _U(0x000F0FFF) /**< \brief (ADCIFE_VERSION) MASK Register */

/* -------- ADCIFE_PARAMETER : (ADCIFE Offset: 0x44) (R/  32) Parameter Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t N:8;              /*!< bit:  0.. 7  Number of channels                 */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ADCIFE_PARAMETER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADCIFE_PARAMETER_OFFSET     0x44         /**< \brief (ADCIFE_PARAMETER offset) Parameter Register */

#define ADCIFE_PARAMETER_N_Pos      0            /**< \brief (ADCIFE_PARAMETER) Number of channels */
#define ADCIFE_PARAMETER_N_Msk      (_U(0xFF) << ADCIFE_PARAMETER_N_Pos)
#define ADCIFE_PARAMETER_N(value)   (ADCIFE_PARAMETER_N_Msk & ((value) << ADCIFE_PARAMETER_N_Pos))
#define ADCIFE_PARAMETER_MASK       _U(0x000000FF) /**< \brief (ADCIFE_PARAMETER) MASK Register */

/** \brief ADCIFE hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __O  ADCIFE_CR_Type            CR;          /**< \brief Offset: 0x00 ( /W 32) Control Register */
  __IO ADCIFE_CFG_Type           CFG;         /**< \brief Offset: 0x04 (R/W 32) Configuration Register */
  __I  ADCIFE_SR_Type            SR;          /**< \brief Offset: 0x08 (R/  32) Status Register */
  __O  ADCIFE_SCR_Type           SCR;         /**< \brief Offset: 0x0C ( /W 32) Status Clear Register */
  __IO ADCIFE_RTS_Type           RTS;         /**< \brief Offset: 0x10 (R/W 32) Resistive Touch Screen Register */
  __IO ADCIFE_SEQCFG_Type        SEQCFG;      /**< \brief Offset: 0x14 (R/W 32) Sequencer Configuration Register */
  __O  ADCIFE_CDMA_Type          CDMA;        /**< \brief Offset: 0x18 ( /W 32) Configuration Direct Memory Access Register */
  __IO ADCIFE_TIM_Type           TIM;         /**< \brief Offset: 0x1C (R/W 32) Timing Configuration Register */
  __IO ADCIFE_ITIMER_Type        ITIMER;      /**< \brief Offset: 0x20 (R/W 32) Internal Timer Register */
  __IO ADCIFE_WCFG_Type          WCFG;        /**< \brief Offset: 0x24 (R/W 32) Window Monitor Configuration Register */
  __IO ADCIFE_WTH_Type           WTH;         /**< \brief Offset: 0x28 (R/W 32) Window Monitor Threshold Configuration Register */
  __I  ADCIFE_LCV_Type           LCV;         /**< \brief Offset: 0x2C (R/  32) Sequencer Last Converted Value Register */
  __O  ADCIFE_IER_Type           IER;         /**< \brief Offset: 0x30 ( /W 32) Interrupt Enable Register */
  __O  ADCIFE_IDR_Type           IDR;         /**< \brief Offset: 0x34 ( /W 32) Interrupt Disable Register */
  __I  ADCIFE_IMR_Type           IMR;         /**< \brief Offset: 0x38 (R/  32) Interrupt Mask Register */
  __IO ADCIFE_CALIB_Type         CALIB;       /**< \brief Offset: 0x3C (R/W 32) Calibration Register */
  __I  ADCIFE_VERSION_Type       VERSION;     /**< \brief Offset: 0x40 (R/  32) Version Register */
  __I  ADCIFE_PARAMETER_Type     PARAMETER;   /**< \brief Offset: 0x44 (R/  32) Parameter Register */
 } bf;
 struct {
  WoReg   ADCIFE_CR;          /**< \brief (ADCIFE Offset: 0x00) Control Register */
  RwReg   ADCIFE_CFG;         /**< \brief (ADCIFE Offset: 0x04) Configuration Register */
  RoReg   ADCIFE_SR;          /**< \brief (ADCIFE Offset: 0x08) Status Register */
  WoReg   ADCIFE_SCR;         /**< \brief (ADCIFE Offset: 0x0C) Status Clear Register */
  RwReg   ADCIFE_RTS;         /**< \brief (ADCIFE Offset: 0x10) Resistive Touch Screen Register */
  RwReg   ADCIFE_SEQCFG;      /**< \brief (ADCIFE Offset: 0x14) Sequencer Configuration Register */
  WoReg   ADCIFE_CDMA;        /**< \brief (ADCIFE Offset: 0x18) Configuration Direct Memory Access Register */
  RwReg   ADCIFE_TIM;         /**< \brief (ADCIFE Offset: 0x1C) Timing Configuration Register */
  RwReg   ADCIFE_ITIMER;      /**< \brief (ADCIFE Offset: 0x20) Internal Timer Register */
  RwReg   ADCIFE_WCFG;        /**< \brief (ADCIFE Offset: 0x24) Window Monitor Configuration Register */
  RwReg   ADCIFE_WTH;         /**< \brief (ADCIFE Offset: 0x28) Window Monitor Threshold Configuration Register */
  RoReg   ADCIFE_LCV;         /**< \brief (ADCIFE Offset: 0x2C) Sequencer Last Converted Value Register */
  WoReg   ADCIFE_IER;         /**< \brief (ADCIFE Offset: 0x30) Interrupt Enable Register */
  WoReg   ADCIFE_IDR;         /**< \brief (ADCIFE Offset: 0x34) Interrupt Disable Register */
  RoReg   ADCIFE_IMR;         /**< \brief (ADCIFE Offset: 0x38) Interrupt Mask Register */
  RwReg   ADCIFE_CALIB;       /**< \brief (ADCIFE Offset: 0x3C) Calibration Register */
  RoReg   ADCIFE_VERSION;     /**< \brief (ADCIFE Offset: 0x40) Version Register */
  RoReg   ADCIFE_PARAMETER;   /**< \brief (ADCIFE Offset: 0x44) Parameter Register */
 } reg;
} Adcife;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAM4L_ADCIFE_COMPONENT_ */
